IDEA Open Model
ConcreteMemberType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Member type
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum ConcreteMemberType
Public Enumeration ConcreteMemberType
Members
Member name | Value | Description
NoDefined | 0 |  Not defined
Beam | 1 |  Beam
Column | 2 |  Column
BeamSlab | 4 |  Beam slab
HollowCoreSlab | 8 |  Hollw core slab
TwoWaySlab | 16 |  2-way slab
Plate | 32 |  Plate
Wall | 64 |  Wall
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace